data/00_cases/cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          29134;
        startFace       28867;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          57;
        startFace       58001;
    }
    topAndBottom
    {
        type            wall;
        physicalType    wall;
        nFaces          294;
        startFace       58058;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          77;
        startFace       58352;
    }
    cylinder
    {
        type            wall;
        physicalType    wall;
        nFaces          106;
        startFace       58429;
    }
)

// ************************************************************************* //
