data/00_cases/cylinder/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         80;

deltaT          0.001;

writeControl    runTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;

adjustTimeStep	true;

maxCo			0.95;


// ************************************************************************* //

//	functions
//	{
//		sampleSurfaces
//		{
//			type            surfaces;
//			libs            ("libsampling.so");
//			writeControl    runTime;
//			writeInterval   1;
//	
//			surfaceFormat   vtk;
//			fields          (p U);
//	
//			interpolationScheme cellPoint;
//	
//			surfaces
//			{
//				zNormal
//				{
//					type        cuttingPlane;
//					point       (0 0 0.05);
//					normal      (0 0 1);
//					interpolate true;
//				}
//			};
//		};
//	}